Documents/ЛБ_ОтменитьШаблонПриказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ОтменитьШаблонПриказа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_УстановкаОтменаШаблонаПриказа</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийУстановитьШаблонПриказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛомбарды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПриказа</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_УстановитьШаблонПриказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаБезНулей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_УстановкаОтменаШаблонаПриказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_УстановкаОтменаШаблонаПриказа</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШаблонПриказа</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_УстановитьШаблонПриказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидШаблона</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийУстановитьШаблонПриказа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийУстановитьШаблонПриказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийУстановитьШаблонПриказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроцентныеСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Металлы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентныеСтавкиАкция</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_ОтменитьШаблонПриказа/Ext/ObjectModule.bsl
// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ШаблонПриказа) Тогда 
			ОбщегоНазначения.СообщитьПользователю("Не выбран шаблон приказа для отмены!");
			Отказ = Истина;      
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
	
// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Движения.ЛБ_УстановкаОтменаШаблонаПриказа.Записывать = Истина;
		
	ОбменДаннымиСервер.УдалитьДвиженияУДокумента(ЭтотОбъект);
	
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавки Тогда 
		Для каждого Стр Из ЭтотОбъект.Ломбарды Цикл
			ДвижениеШаблон = Движения.ЛБ_УстановкаОтменаШаблонаПриказа.Добавить();
			ДвижениеШаблон.Период = Дата;
			ДвижениеШаблон.Ломбард = Стр.Ломбард;
			ДвижениеШаблон.СхемаКредитования = ЭтотОбъект.СхемаКредитования;  
			ДвижениеШаблон.ВидШаблона = ЭтотОбъект.ВидОперации;
			ДвижениеШаблон.ШаблонПриказа = ЭтотОбъект.ШаблонПриказа;
            ДвижениеШаблон.Отменен = Истина;
		КонецЦикла;	
	ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавкиАкция Тогда 
		Для каждого Стр Из ЭтотОбъект.Ломбарды Цикл
			ДвижениеШаблон = Движения.ЛБ_УстановкаОтменаШаблонаПриказа.Добавить();
			ДвижениеШаблон.Период = Дата;
			ДвижениеШаблон.Ломбард = Стр.Ломбард;
			ДвижениеШаблон.Акция = ЭтотОбъект.Акция;  
			ДвижениеШаблон.ВидШаблона = ЭтотОбъект.ВидОперации;
			ДвижениеШаблон.ШаблонПриказа = ЭтотОбъект.ШаблонПриказа;
            ДвижениеШаблон.Отменен = Истина;
		КонецЦикла;	
	Иначе
		Для каждого Стр Из ЭтотОбъект.Ломбарды Цикл
			ДвижениеШаблон = Движения.ЛБ_УстановкаОтменаШаблонаПриказа.Добавить();
			ДвижениеШаблон.Период = Дата;
			ДвижениеШаблон.Ломбард = Стр.Ломбард;
			ДвижениеШаблон.ВидШаблона = ЭтотОбъект.ВидОперации;
			ДвижениеШаблон.ШаблонПриказа = ЭтотОбъект.ШаблонПриказа;
            ДвижениеШаблон.Отменен = Истина;
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры	

//+МАН 16.03.26 Добавлена запись номера без нулей. Завка 3654.
Процедура ПриЗаписи(Отказ)
	Если ПустаяСтрока(ЭтотОбъект.НомерДокументаБезНулей) Тогда
		ЭтотОбъект.НомерДокументаБезНулей = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(ЭтотОбъект.Номер, "0");
		ЭтотОбъект.Записать();
	КонецЕсли;
КонецПроцедуры
//-МАН
